export default defineEventHandler( (event) => {
    return [
        {
          no: 1,
          operator: 'กฟฟ.',
          detail: 'Upload asdasdasdasdFile ZAAR020 (from SAP)',
          document: 'File รายงานขออนุมัติจำหน่ายมิเตอร์ชำรุด (ZAAR020)',
          status: 20,
          statusDesciption: 'ดำเนินการแล้ว',
          date: '2024-09-11T11:20:30',
          comment:''
        },
        {
          no: 2,
          operator: 'กฟฟ.',
          detail: 'รายงานผลจากคณะกรรมการสอบหาข้อเท็จจริง สรุปจำนวนที่ต้องการจำหน่าย ส่งหา กบล.',
          document: 'หนังสือขออนุมัติจำหน่ายมิเตอร์และอุปกรณ์ประกอบ',
          status: 20,
          statusDesciption: 'ดำเนินการแล้ว',
          date: '2024-09-12T14:30:00',
          comment:''
        },
        {
          no: 3,
          operator: 'ผบส.กบฟ.ฝสบ.น.3',
          detail: `ผู้มีอำนาจอนุมัติจำหน่าย (ส่งกลับ กบล., กบฟ. เพื่อทราบ และ กฟฟ. เพื่อดำเนินการต่อ(พ(ม). 61/2566))`,
          document: 'หนังสืออนุมัติจำหน่ายจากผู้มีอำนาจลงนาม',
          status: 20,
          statusDesciption: 'รอดำเนินการ',
          date: '2024-09-13T09:00:00',
          comment:''
        },
        {
          no: 4,
          operator: `กฟฟ.คณะกรรมการประเมินราคา`,
          detail: 'คณะกรรมการประเมินราคากำหนดราคาขายขั้นต่ำ โดยดำเนินการตามข้อ 4.1 และ 4.2',
          document: 'คำนวณราคาและขออนุมัติเห็นชอบราคาขายขั้นต่ำ',
          status: 20,
          statusDesciption: 'อนุมัติแล้ว',
          date: '2024-09-14T15:45:00',
          comment:''
        },
        {
          no: 5,
          operator: 'กฟฟ.คณะกรรมการประเมินราคา',
          detail: 'คำนวณราคาของมิเตอร์ ซีที พีที ที่ต้องการขาย (ราคากลาง) จากสูตรของ กบล.',
          document: 'ตารางคำนวณการประเมินราคา',
          status: 20,
          statusDesciption: 'ดำเนินการแล้ว',
          date: '2024-09-15T10:20:00',
          comment:''
        },
        {
          no: 6,
          operator: `กฟฟ.คณะกรรมการประเมินราคา`,
          detail: `คณะกรรมการประเมินราคา ทำหนังสือขอความเห็นชอบกำหนดราคาขั้นต่ำฯ เสนอผู้มีอำนาจฯ*
      ผู้มีอำนาจ อนุมัติกำหนดราคาขั้นต่ำแล้ว`,
          document: 'หนังสืออนุมัติเห็นชอบราคาขายขั้นต่ำ',
          status: 20,
          statusDesciption: 'รอดำเนินการ',
          date: '2024-09-16T08:00:00',
          comment:''
        },
        {
          no: 7,
          operator: 'กฟฟ.',
          detail: 'กฟฟ. จัดทำหนังสือขออนุมัติหลักการขายจากผู้มีอำนาจสั่งขาย',
          document: 'หนังสืออนุมัติหลักการขาย',
          status: 10,
          statusDesciption: 'รอดำเนินการ',
          date: '2024-09-17T16:30:00',
          comment:''
        },
        {
          no: 8,
          operator: 'กฟฟ.',
          detail: 'ระบุวิธีการขาย มี 3 วิธี',
          document: 'รายงานการปิดสถานะการจำหน่าย',
          status: 10,
          statusDesciption: 'รอดำเนินการ',
          date: '2024-09-18T12:15:00',
          comment:''
        },
        {
          no: 9,
          operator: 'กฟฟ.',
          detail: 'จัดทำเอกสารประกาศขายและเผยแพร่การขาย',
          document: 'เอกสารประกาศขายและเผยแพร่การขาย',
          status: 10,
          statusDesciption: 'รอดำเนินการ',
          date: '2024-09-18T12:15:00',
          comment:''
        },
        {
          no: '9.1',
          operator: 'กฟฟ.คณะกรรมการดำเนินการขาย',
          detail: 'ผู้สนใจเข้ารับซอง ให้ กฟฟ.จัดทำเอกสารลงทะเบียนการรับซอง (ตามวันที่กำหนดไว้ในหนังสือประกาศขาย)',
          document: 'เอกสารประกาศขายและเผยแพร่การขาย',
          status: 10,
          statusDesciption: 'รอดำเนินการ',
          date: '2024-09-18T12:15:00',
          comment:''
        }
        ,
        {
          no: '9.2',
          operator: 'กฟฟ.',
          detail: `ผู้เสนอราคายื่นซองเสนอราคา พร้อมวางหลักประกันซอง
      (ยื่นซองฯ พร้อมวางหลักประกัน 5%) ให้ กฟฟ.จัดทำทะเบียนรับซองเสนอราคา และทำตารางเปรียบเทียบราคาแต่ละเจ้า`,
          document: 'ทะเบียนการรับเอกสาร พร้อมวางหลักประกันซอง และตารางเปรียบเทียบราคาเปิดซอง',
          status: 10,
          statusDesciption: 'รอดำเนินการ',
          date: '2024-09-18T12:15:00',
          comment:''
        },
        {
          no: 10,
          operator: 'กฟฟ.',
          detail: `กฟฟ.คณะกรรมการดำเนินการขาย`,
          document: 'ขออนุมัติรับราคา และขออนุมัติขาย',
          status: 10,
          statusDesciption: 'รอดำเนินการ',
          date: '2024-09-18T12:15:00',
          comment:''
        }
        ,
        {
          no: 10,
          operator: 'กฟฟ.คณะกรรมการดำเนินการขาย',
          detail: `กฟฟ. รับชำระเงิน และออกใบเสร็จให้ผู้รับซื้อ`,
          document: 'ใบเสร็จรับเงิน',
          status: 10,
          statusDesciption: 'รอดำเนินการ',
          date: '2024-09-18T12:15:00',
          comment:''
        } ,
        {
          no: '10.1',
          operator: 'กฟฟ.คณะกรรมการดำเนินการขาย',
          detail: `กฟฟ. ตัดจำหน่าย (ZMME024) และพิมพ์ใบจ่ายของ (ตัดจำหน่าย MIGO MvT 555)`,
          document: 'ใบจ่ายของ (ตัดจำหน่าย MvT 555)',
          status: 10,
          statusDesciption: 'รอดำเนินการ',
          date: '2024-09-18T12:15:00',
          comment:''
        },
        {
          no: 11,
          operator: 'กฟฟ.คณะกรรมการดำเนินการขาย',
          detail: `คณะกรรมการส่งมอบพัสดุ ทำหนังสือรายงานผลการดำเนินการขาย และส่งมอบ`,
          document: 'หนังสือรายงานการส่งมอบและรับมอบ',
          status: 10,
          statusDesciption: 'รอดำเนินการ',
          date: '2024-09-18T12:15:00',
          comment:''
        },
        {
          no: 12,
          operator: 'กฟฟ.คณะกรรมการส่งมอบพัสดุ',
          detail: `รายงานผลการขาย ส่งให้ กบฟ.ฝสบ.น.3 เพื่อตัดจำหน่ายออกจากบัญชีสินทรัพย์`,
          document: 'หนังสือรายงานการขาย',
          status: 10,
          statusDesciption: 'รอดำเนินการ',
          date: '2024-09-18T12:15:00',
          comment:''
        },
        {
          no: 13,
          operator: 'ผบส.กบฟ.ฝสบ.น.3',
          detail: `กบฟ.ฝสบ.น.3 ตัดจำหน่ายทรัพย์สินออกจากระบบบัญชีสินทรัพย์`,
          document: 'ตัดจำหน่ายทรัพย์สิน (AA)',
          status: 10,
          statusDesciption: 'รอดำเนินการ',
          date: '2024-09-18T12:15:00',
          comment:''
        }
      ]
  })